{
  "architectures": [
    "IsaacForConditionalGeneration"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "modular_isaac.IsaacConfig",
    "AutoModelForCausalLM": "modular_isaac.IsaacForConditionalGeneration"
  },
  "bos_token_id": 151643,
  "dtype": "float32",
  "eos_token_id": 151645,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 6144,
  "layer_types": [
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention"
  ],
  "max_position_embeddings": 40960,
  "max_sequence_length": 16384,
  "max_window_layers": 28,
  "model_type": "isaac",
  "num_attention_heads": 16,
  "num_hidden_layers": 28,
  "num_key_value_heads": 8,
  "pixel_shuffle_scale": 2,
  "rms_norm_eps": 1e-06,
  "rope_scaling": {
    "mrope_interleaved": true,
    "mrope_section": null,
    "rope_type": "default"
  },
  "rope_theta": 1000000.0,
  "sliding_window": null,
  "tie_word_embeddings": false,
  "transformers_version": "4.57.1",
  "use_cache": true,
  "use_sliding_window": false,
  "video_patch_size": 16,
  "vision_attn_implementation": null,
  "vision_config": {
    "attention_dropout": 0.0,
    "dtype": "float32",
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_size": 1152,
    "image_size": 256,
    "intermediate_size": 4304,
    "layer_norm_eps": 1e-06,
    "model_type": "pixel_shuffle_siglip2",
    "num_attention_heads": 16,
    "num_channels": 3,
    "num_hidden_layers": 27,
    "num_patches": 256,
    "patch_size": 16,
    "pixel_shuffle_scale_factor": 2
  },
  "vision_max_num_patches": 6144,
  "vision_min_num_patches": 256,
  "vision_token": "<image>",
  "vocab_size": 151936
}
